Core/src/src/Documents/ОтпускаСотрудников/ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтпускаСотрудников</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ДниОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтпуска</name>
      <type>
        <types>CatalogRef.ВидыОтпусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/ОтпускаСотрудников/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаОтпускаСотрудников, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =   
		"ВЫБРАТЬ
		|	ОтпускаСотрудниковСотрудники.Ссылка.Ссылка КАК Регистратор,
		|	ОтпускаСотрудниковСотрудники.Ссылка.Номер КАК Номер,
		|	ОтпускаСотрудниковСотрудники.Ссылка.Дата КАК Период,
		|	ОтпускаСотрудниковСотрудники.Ссылка.Автор КАК Автор,
		|	ОтпускаСотрудниковСотрудники.Ссылка.Организация КАК Организация,
		|	ОтпускаСотрудниковСотрудники.НомерСтроки КАК НомерСтроки,
		|	ОтпускаСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ОтпускаСотрудниковСотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ОтпускаСотрудниковСотрудники.ВидОтпуска КАК ВидНачисленияОтпуска,
		|	ОтпускаСотрудниковСотрудники.ДатаНачала КАК ДатаНачала,
		|	ОтпускаСотрудниковСотрудники.ДатаОкончания КАК ДатаОкончания,
		|	ОтпускаСотрудниковСотрудники.КоличествоДней КАК КоличествоДней
		|ПОМЕСТИТЬ ВременнаяТаблицаСотрудники
		|ИЗ
		|	Документ.ОтпускаСотрудников.Сотрудники КАК ОтпускаСотрудниковСотрудники
		|ГДЕ
		|	ОтпускаСотрудниковСотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаОтпускаСотрудников);   
	
	МассивРезультатов = Запрос.ВыполнитьПакет();     
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДниОтпускаСотрудников(ДокументСсылкаОтпускаСотрудников, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаДниОтпускаСотрудников(ДокументСсылкаОтпускаСотрудников, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ИнтерфейсПечати

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Приказ_Т5");
	//Если ПечатнаяФорма <> Неопределено Тогда
	//	
	//	ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
	//	ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КадровоеПеремещение_Т5";
	//	ПечатнаяФорма.ПолныйПутьКМакету = "Документ.КадровоеПеремещение.ПФ_MXL_Т5";
	//	ПечатнаяФорма.СинонимМакета = НСтр("ka='Т-5 (Приказ о переводе)';ru='Т-5 (Приказ о переводе)';en='T-5 (transfer order)'");
	//	
	//	СформироватьКадровыйПриказ(ПечатнаяФорма, МассивОбъектов, ОбъектыПечати);
	//	
	//КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
